performance_test.yml
# Fichero para evaluación de prestaciones con Taurus:
execution:
    - concurrency: 10   # 10 usuarios simultáneos
      ramp-up: 10s    # En 10s se alcanzan los 10 usuarios
      hold-for: 50s   # Cada usuario mantiene la conexión durante 50s
      scenario: portfolio-test  # Nombre del test (escenario) a ejecutar

# Ahora definimos el test/escenario a ejecutar:
scenarios:
    portfolio-test:
        # Las peticiones que se harán:
        requests:
        # El POST solo se hará una vez por hebra (solo podemos tener un evento con el
        # mismo título, por lo que solo una petición será correcta: la primera)
        - once:
          - url: http://localhost:8080/portfolio/
            method: POST
            # Indicamos que el contenido de la petición es un JSON
            headers:
              Content-Type: application/json
            # En el cuerpo, indicamos los parámetros del JSON:
            body:
              user_dni: "12345678X"
              user_name: "Francisco"
        # Ahora hacemos dos peticiones GET: la primera es correcta, la segunda devuelve 404:
        - url: http://127.0.0.1:8080/portfolio/12345678X
          method: GET
        - url: http://127.0.0.1:8080/portfolio/12345678X/saldo
          method: GET
        - url: http://127.0.0.1:8080/portfolio/12345678X/acciones
          method: GET