performance_test.yml
# Fichero de evaluación de prestaciones con Taurus:
execution:
    # 10 usuarios
    - concurrency: 10
      # Tiempo en el que se alcanzan los 10 usuarios
      ramp-up: 10s
      # Duración de la conexión 50 segundos
      hold-for: 50s
      # Nombre del escenario a ejecuta
      scenario: portfolio-test

# Ahora definimos el test/escenario a ejecutar:
scenarios:
    portfolio-test
        requests:
        # Indicamos que el POST se ejecute una sola vez por hebra
        - once:
          - url: http://localhost:8080/portfolio/
            method: POST
            # Formato JSON
            headers:
              Content-Type: application/json
            # Contenido de la petición
            body:
              # DNI del usuario
              user_dni: "12345678X"
              # Nombre del usuario
              user_name: "Francisco"
        # Petición para obtener la información de un usuario
        - url: http://127.0.0.1:8080/portfolio/12345678X
          method: GET
        # Petición para obtener el saldo de un usuario
        - url: http://127.0.0.1:8080/portfolio/12345678X/saldo
          method: GET
        # Petición para obtener las acciones que un usuario tiene compradas
        - url: http://127.0.0.1:8080/portfolio/12345678X/acciones
          method: GET